3A/CS349/HTML-CSS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-25 Sun 12:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HTML and CSS</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">HTML and CSS</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbee04de">1. HTML and DOM</a>
<ul>
<li><a href="#orgd5538df">1.1. Document Object Model (DOM)</a></li>
</ul>
</li>
<li><a href="#org46b9489">2. CSS Selectors</a>
<ul>
<li><a href="#org5ec41f4">2.1. CSS Selector</a></li>
<li><a href="#org3789009">2.2. CSS Cascade</a></li>
</ul>
</li>
<li><a href="#org44cafe1">3. Flexbox Layout</a></li>
<li><a href="#org30b95be">4. DOM Manipulation with TypeScript</a>
<ul>
<li><a href="#org64eacb6">4.1. General Development Steps</a>
<ul>
<li><a href="#orgb516fc4">4.1.1. DOM Events</a></li>
</ul>
</li>
<li><a href="#org3b3d27c">4.2. Imperative Code</a></li>
<li><a href="#org2d7ee08">4.3. String Templates</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbee04de" class="outline-2">
<h2 id="orgbee04de"><span class="section-number-2">1.</span> HTML and DOM</h2>
<div class="outline-text-2" id="text-1">
<p>
Hypertext Markup Language, defines meaning and structure of the interface using a declarative
syntax.
</p>

<p>
<b>Tag</b>: syntax that defines an element and its attributes
</p>

<p>
<b>Attribute</b>: extra info to define elements
</p>

<p>
<b>Element</b>: what the tag and attributes create
</p>
</div>
<div id="outline-container-orgd5538df" class="outline-3">
<h3 id="orgd5538df"><span class="section-number-3">1.1.</span> Document Object Model (DOM)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Cross-platform and language independent interface that treats an HTML document as a tree
struture of node objects representing a part of the document.
</p>

<p>
Every element in the DOM is a node.
</p>

<p>
Events are also part of the DOM.
</p>

<p>
<code>div</code> is a block-level element, <code>span</code> is an inline element.
</p>
</div>
</div>
</div>
<div id="outline-container-org46b9489" class="outline-2">
<h2 id="org46b9489"><span class="section-number-2">2.</span> CSS Selectors</h2>
<div class="outline-text-2" id="text-2">
<p>
Cascading Style Sheets, defines visual style, layout, and animation using a declarative
syntax.
</p>

<p>
<b>CSS Rule</b>: has a selector, declaration block, and 1+ properties with values
</p>

<p>
CSS rules can be specified in an HTML tag, inline in <code>style</code> tags, or as a link
to a CSS file.
</p>
</div>
<div id="outline-container-org5ec41f4" class="outline-3">
<h3 id="org5ec41f4"><span class="section-number-3">2.1.</span> CSS Selector</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A pattern to select or find elements in the DOM.
</p>

<p>
Basic selectors are tag type, class name (with dot), element id attribute (with #),
and elements matching attribute value (with a matcher inside []).
</p>

<p>
Hierarchical selectors select child elements by parent-child relationship (using &gt;)
or descendant relationship (by listing tags separated by spaces).
</p>

<p>
Pseudo class selectors use colon on known names such as <code>first-child</code> or <code>hover</code>.
</p>

<p>
All selectors above can be combined.
</p>
</div>
</div>
<div id="outline-container-org3789009" class="outline-3">
<h3 id="org3789009"><span class="section-number-3">2.2.</span> CSS Cascade</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Defines the precedence of CSS rules when multiple declarations apply to the same
element.
</p>

<p>
Precedences are:
</p>
<ul class="org-ul">
<li>who specified the rule, such as agent, author, or user</li>
<li>where it was specified: file or style tag vs inline style attribute</li>
<li>when it was specified, which is the order of the rules</li>
<li>importance using <code>!important</code></li>
<li>specificity of rule</li>
</ul>

<p>
<b>Specificity</b>: a standard method to determine which CSS rule declaration is most
relevant to an element
</p>
</div>
</div>
</div>
<div id="outline-container-org44cafe1" class="outline-2">
<h2 id="org44cafe1"><span class="section-number-2">3.</span> Flexbox Layout</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>Main axis</b> is row or column, <b>cross axis</b> is perpendicular to main axis.
</p>

<p>
Includes a flex container and flex items within.
</p>

<p>
To make a parent a flex container, set its CSS display property to flex and its children
become flex items.
</p>

<p>
Flexbox items can group to fill space, shrink to fit into space, or have a custom basis
set.
</p>

<p>
Flexbox container can align its items (stretch, start, end, or center), align itself
along the same axes, justify its content along the main axis (start, end, center,
between, around, evenly), or set a gap between its items.
</p>
</div>
</div>
<div id="outline-container-org30b95be" class="outline-2">
<h2 id="org30b95be"><span class="section-number-2">4.</span> DOM Manipulation with TypeScript</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org64eacb6" class="outline-3">
<h3 id="org64eacb6"><span class="section-number-3">4.1.</span> General Development Steps</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li><b>mock up HTML as static page</b>: think about how to identify each part using id, name,
structure, etc</li>
<li><b>add CSS</b>: to create visual style, layout, etc</li>
<li><b>divide HTML for manipulation approach</b>: could be separate strings, HTML templates,
etc</li>
<li><b>create views for main parts of interface</b>: divide CSS into views, build view from
code or strings, create controllers using event listeners, attach everything to a
root element for the view, implement observer update method</li>
</ol>

<p>
Can get HTML elements using id or CSS selector syntax, should specify expected element
type and need to handle case if reference is not found.
</p>
</div>
<div id="outline-container-orgb516fc4" class="outline-4">
<h4 id="orgb516fc4"><span class="section-number-4">4.1.1.</span> DOM Events</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Dispatch using capture and bubble phases with adding event listeners.
</p>

<p>
Has mouse event and keyboard events derived from event base class with time info.
</p>
</div>
</div>
</div>
<div id="outline-container-org3b3d27c" class="outline-3">
<h3 id="org3b3d27c"><span class="section-number-3">4.2.</span> Imperative Code</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Build HTML by creating elements and appending children, step-by-step in code.
</p>

<p>
App has a root and all views have a root element to enable this.
</p>

<p>
Separate CSS files with selectors that apply only to specfic views, can be imported
in code.
</p>

<p>
<b>Problem</b>: adding elements (or one by one) is too slow
</p>
</div>
</div>
<div id="outline-container-org2d7ee08" class="outline-3">
<h3 id="org2d7ee08"><span class="section-number-3">4.3.</span> String Templates</h3>
<div class="outline-text-3" id="text-4-3">
<p>
A tag tranforms a template literal before creating a string.
</p>

<p>
A tag here is a function called with arguments from the template literal.
The first argument is an array of \(N+1\) strings. Other arguments are \(N\)
strings created from template values.
</p>

<p>
Best practice is to pass HTML templates through an <code>html</code> tag, to escape embedded
HTML and sanitize HTML.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-25 Sun 12:31</p>
</div>
</body>
</html>
